/***********************************************************************

	点検・キャリブの設定値を設定するCalibCommの子グループ

***********************************************************************/
#include	"CalibComm.h"
#include	"CalibSetting.h"


/***********************************************************************

	パネル初期化時
	に呼ぶ関数

***********************************************************************/
int CalibSetting::Init(CALIB_MSEBOX* para)
{
	int ret = 0;

	// ゲージ設定の取得
	ret |= CalibInit(0, CALIB_MODE_BALL);	// ダミー処理(DLL内の構造を改善するべき) 2025.9.25 memo eba
	ret |= CalibGetGaugeVal(&para->GaugePara);


	return (ret);
}


/***********************************************************************

	OKボタンクリック
	に呼ぶ関数

***********************************************************************/
int CalibSetting::OkBtn(CALIB_MSEBOX* para)
{
	int ret = 0;

	ret |= CalibSetGaugeVal(para->GaugePara);
	ret |= CalibEnd();  // // ダミー処理(DLL内の構造を改善するべき) 2025.9.25 memo eba


	return (ret);
}


/***********************************************************************

	Cancelボタンクリック
	に呼ぶ関数

***********************************************************************/
int CalibSetting::CancelBtn(CALIB_MSEBOX* para)
{
	int ret = 0;

	
	ret |= CalibEnd();  // // ダミー処理(DLL内の構造を改善するべき) 2025.9.25 memo eba


	return (ret);
}


