/***********************************************************************

    C++ DLL からエクスポートする関数群
    これらの関数を呼び出すC#ラッパー関数を別に作成する

***********************************************************************/

#include "common.h"
#include "CPX.h"
#include "UsrMsg.h"



/***********************************************************************

    コールバック関数の設定

***********************************************************************/

void WINAPI CPX_UsrMsg_SetCB( SM_CBFUNC f )
{
    UsrMsg::SetCB( f );

    return;
}
