/***********************************************************************

    C++ DLL からエクスポートする関数群
    これらの関数を呼び出すC#ラッパー関数を別に作成する

***********************************************************************/

#include "common.h"
#include "CPX.h"
#include "UsrMsgBox.h"



/***********************************************************************

    コールバック関数の設定

***********************************************************************/

void WINAPI CPX_UsrMsgBox_SetCB( UMB_CBFUNC f )
{
    UsrMsgBox::SetCB( f );

    return;
}
