/***********************************************************************

    C++ DLL からエクスポートする関数群
    これらの関数を呼び出すC#ラッパー関数を別に作成する

***********************************************************************/

#include "common.h"
#include "CPX.h"
#include "ErrMsg.h"



/***********************************************************************

    コールバック関数の設定

***********************************************************************/

void WINAPI CPX_ErrMsg_SetCB( ER_CBFUNC f )
{
    ErrMsg::SetCB( f );

    return;
}



/***********************************************************************

    メッセージの取得

***********************************************************************/

int WINAPI CPX_ErrMsg_GetMsg(
    int             MsgID,      // i メッセージID
    TCHAR*&         pStr,       // i 文字列バッファ
    int             Str_count   // i 文字列バッファサイズ
)
{
    int     rc;

    rc = ErrMsg::GetMsg( MsgID, pStr, Str_count );

    return( rc );
}