/***********************************************************************

    C++ DLL からエクスポートする関数群
    これらの関数を呼び出すC#ラッパー関数を別に作成する
    CPX_Grp02.cppをコピーして追加(2025.6.19yori)

***********************************************************************/

#include "common.h"
#include "CPX.h"
#include "Grp03.h"



/***********************************************************************

    Cmd01

***********************************************************************/

int WINAPI CPX_Grp03_Cmd01()
{
    int     rc;
    
    rc = Grp03::Cmd01();

    return( rc );
}



/***********************************************************************

    Cmd02

***********************************************************************/

int WINAPI CPX_Grp03_Cmd02()
{
    int     rc;
    
    rc = Grp03::Cmd02();

    return( rc );
}



/***********************************************************************

    Cmd03

***********************************************************************/

int WINAPI CPX_Grp03_Cmd03()
{
    int     rc;
    
    rc = Grp03::Cmd03();

    return( rc );
}



/***********************************************************************

    Cmd04

***********************************************************************/

int WINAPI CPX_Grp03_Cmd04()
{
    int     rc;

    rc = Grp03::Cmd04();

    return(rc);
}



/***********************************************************************

    Cmd05
    追加(2025.8.11yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd05()
{
    int     rc;

    rc = Grp03::Cmd05();

    return(rc);
}



/***********************************************************************

    Cmd06
    追加(2025.8.12yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd06(int scanmode)
{
    int     rc;

    rc = Grp03::Cmd06(scanmode);

    return(rc);
}



/***********************************************************************

    Cmd07
    追加(2025.8.21yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd07(int sens)
{
    int     rc;

    rc = Grp03::Cmd07(sens);

    return(rc);
}



/***********************************************************************

    Cmd08
    追加(2025.8.21yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd08(int power)
{
    int     rc;

    rc = Grp03::Cmd08(power);

    return(rc);
}



/***********************************************************************

    Cmd09
    追加(2025.8.21yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd09(int xpitch)
{
    int     rc;

    rc = Grp03::Cmd09(xpitch);

    return(rc);
}



/***********************************************************************

    Cmd10
    追加(2025.8.23yori)
    引数追加(2026.8.7yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd10(STATUS02* sts)
{
    int     rc;

    rc = Grp03::Cmd10(sts);

    return(rc);
}



/***********************************************************************

    Cmd11
    追加(2025.8.24yori)
    引数追加(2026.8.5yori)
    unsigned short bright_slice[5]→unsigned short* bright_slice(2026.8.18yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd11(unsigned short* bright_slice)
{
    int     rc;

    rc = Grp03::Cmd11(bright_slice);

    return(rc);
}



/***********************************************************************

    Cmd12
    追加(2025.8.24yori)
    引数追加(2026.8.5yori)
    unsigned short sens_slice[5]→unsigned short* sens_slice(2026.8.18yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd12(unsigned short* sens_slice)
{
    int     rc;

    rc = Grp03::Cmd12(sens_slice);

    return(rc);
}



/***********************************************************************

    Cmd13
    追加(2025.8.24yori)
    引数追加(2026.8.5yori)
    引数追加(2026.8.31yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd13(int angle_mask_onoff, double angle)
{
    int     rc;

    rc = Grp03::Cmd13(angle_mask_onoff, angle);

    return(rc);
}



/***********************************************************************

    Cmd14
    追加(2025.8.25yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd14(int twopeak)
{
    int     rc;

    rc = Grp03::Cmd14(twopeak);

    return(rc);
}



/***********************************************************************

    Cmd15
    追加(2025.8.25yori)
    引数追加(2026.8.5yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd15(int edge)
{
    int     rc;

    rc = Grp03::Cmd15(edge);

    return(rc);
}



/***********************************************************************

    Cmd16
    追加(2025.8.27yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd16()
{
    int     rc;

    rc = Grp03::Cmd16();

    return(rc);
}



/***********************************************************************

    Cmd17
    追加(2025.8.27yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd17()
{
    int     rc;

    rc = Grp03::Cmd17();

    return(rc);
}



/***********************************************************************

    Cmd18
    追加(2025.11.11yori)

***********************************************************************/

int WINAPI CPX_Grp03_Cmd18()
{
    int     rc;

    rc = Grp03::Cmd18();

    return(rc);
}



/***********************************************************************

    CPX_Grp03_ScannerAlignmentPanelFullCalStartBtn
    2025.12.8yori

***********************************************************************/

int WINAPI CPX_Grp03_ScannerAlignmentPanelFullCalStartBtn()
{
    int     rc;

    rc = Grp03::ScannerAlignmentPanelFullCalStartBtn();

    return(rc);
}



/***********************************************************************

    CPX_Grp03_SetDistMaskEnable
    2026.8.12yori

***********************************************************************/

int WINAPI CPX_Grp03_SetDistMaskEnable(bool* maskfg)
{
    int     rc;

    rc = Grp03::SetDistMaskEnable(maskfg);

    return(rc);
}



/***********************************************************************

    CPX_Grp03_SetBrightSliceLevel
    追加(2026.8.29yori)

***********************************************************************/

int WINAPI CPX_Grp03_SetBrightSliceLevel(STATUS02* sts)
{
    int     rc;

    rc = Grp03::SetBrightSliceLevel(sts);

    return(rc);
}



/***********************************************************************

    CPX_Grp03_SetSensSliceLevel
    追加(2026.8.29yori)

***********************************************************************/

int WINAPI CPX_Grp03_SetSensSliceLevel(STATUS02* sts)
{
    int     rc;

    rc = Grp03::SetSensSliceLevel(sts);

    return(rc);
}



/***********************************************************************

    CPX_Grp03_SetBrightMaskSetting
    追加(2026.9.2yori)

***********************************************************************/

int WINAPI CPX_Grp03_SetBrightMaskSetting(STATUS02* sts)
{
    int     rc;

    rc = Grp03::SetBrightMaskSetting(sts);

    return(rc);
}