/***********************************************************************

    C++ DLL からエクスポートする関数群
    これらの関数を呼び出すC#ラッパー関数を別に作成する

***********************************************************************/

#include "common.h"
#include "CPX.h"
#include "ProgBar.h"



/***********************************************************************

    コールバック関数の設定

***********************************************************************/

void WINAPI CPX_ProgBar_SetCB1( PGB_CBFUNC1 f )
{
    ProgBar::SetCB1( f );

    return;
}


void WINAPI CPX_ProgBar_SetCB2(PGB_CBFUNC2 f)
{
    ProgBar::SetCB2( f );

    return;
}
