/***********************************************************************

    サンプルダイアログ

***********************************************************************/

#include "ErrMsg.h"



/***********************************************************************

    スタティック変数

***********************************************************************/

ER_CBFUNC ErrMsg::CallBack = NULL;



/***********************************************************************

    コールバック関数のセット

***********************************************************************/

void ErrMsg::SetCB( ER_CBFUNC f )
{
    CallBack = f;
}



/***********************************************************************

    メッセージの取得

***********************************************************************/

int ErrMsg::GetMsg(
    int             MegID,      // i メッセージID
    TCHAR*&         pStr,       // i 入力パラメータ(F)
    int             Str_count   // i 入力パラメータ(F_count)
)
{
    if ( Str_count > 0 ) {
        if ( MegID == ERR_MORNING ) { 
            _stprintf_s( pStr, Str_count, _T("おはようございます") );
        }
        else if ( MegID == ERR_HELLO ) { 
            _stprintf_s( pStr, Str_count, _T("こんにちは") );
        }
        else if ( MegID == ERR_EVENING ) { 
            _stprintf_s( pStr, Str_count, _T("こんばんは") );
        }
        else {
            _stprintf_s( pStr, Str_count, _T("不明") );
        }
    }
    else {
        return( 1 );
    }

    return( 0 );
}
